{"id": 0, "subject": "Dorea", "context": "Dorea was trying to cook a Baklava. When she took it out of the oven, the Baklava was ruined as the bread was not crispy, and the filling was bursting all over the pan. At that moment, her daughter came home and noticed her mom's fresh yet ruined Baklava. She tasted it and gave a thumbs-up to her mother.", "choice": ["Delight", "Anger", "Embarrassment", "Hopeless", "Pride", "Disappointment"]}
{"id": 1, "subject": "Simon", "context": "Simon, an amateur painter, had been working on a portrait of his deceased pet for over a week. After he finally completed it, he stepped back and immediately noticed that he had painted the wrong color for his pet's fur. Just then, his wife saw it and exclaimed, \"That's exactly how I remember him!\"", "choice": ["Delight", "Anger", "Embarrassment", "Hopeless", "Pride", "Disappointment"]}
{"id": 2, "subject": "Andy", "context": "After weeks of hard work and determination, Andy was finally able to open his art exhibition and display his portraits. While he invited all of the people at work, none of them showed up. As he was packing up to leave, his boss showed up, pointed to his painting, and praised his skills.", "choice": ["Gratitude & Anger", "Embarrassment & Joy", "Sadness & Anger", "Gratitude & Joy", "Embarrassment & Sadness", "Embarrassment & Anger"]}
{"id": 3, "subject": "Albert", "context": "Albert and his dad made a deal. If Albert managed to graduate, being in the top 5 in the school, his dad would buy him a new laptop. If Albert lost, then he would not get anything. During the announcement, Albert fell short of the list and was ranked 6. The next day, they found out that one of the top 5 contestants had cheated and was disqualified.", "choice": ["Jealousy", "Embarrassment", "Nervousness", "Delight", "Disapproval", "Guilt"]}
{"id": 4, "subject": "Momo", "context": "Momo loved dancing and used it as an escape from her stressful life. Today, her client refused her work multiple times which resulted in her being reprimanded by her boss. Arriving at the dance studio, she put her bag down and screamed before starting to dance. After she finished dancing, Momo closed her eyes and nodded to herself in the mirror.", "choice": ["Relief", "Sadness", "Anger", "Hopeless", "Amusement", "Guilt"]}
{"id": 5, "subject": "Andre", "context": "On his way to work, Andre was stuck in traffic when a person started shouting at him for being a bad driver. Once he came out of the car to confront that person, he realized it was his dad.", "choice": ["Disapproval", "Amusement", "Annoyance", "Nervousness", "Fear", "Unbothered"]}
{"id": 6, "subject": "Mike", "context": "Mike was annoyed with his friend Bob for not inviting him to Bob's birthday party. Then, Mike realized Bob also talks badly about him behind his back to others.", "choice": ["Anger", "Disappointment", "Jealousy", "Nervousness", "Annoyance", "Gratitude"]}
{"id": 7, "subject": "Julius", "context": "Julius was excited to present his innovative idea to the team. During the meeting, his boss brutally criticized his lack of details and clarity. Julius analyzed his boss' comments and realized that this harsh feedback was what he needed to improve. He read over his notes and started refining his ideas.", "choice": ["Hopeful", "Fear", "Hopeless", "Disapproval", "Remorse", "Embarrassment"]}
{"id": 8, "subject": "Liam", "context": "Liam, a teenager often overlooked by his parents, found pride in keeping a flawless academic record. His parents told him they'd be skipping his awards ceremony for his younger brother's baseball game. With a crushing feeling in his heart, he climbed the stage alone. As he looked into the audience, he saw his parents sitting in the front row, smiling and clapping for him.", "choice": ["Pride", "Jealousy", "Sadness", "Disappointment", "Embarrassment", "Delight"]}
{"id": 9, "subject": "Joe", "context": "Joe's biggest hobby is taking pictures of birds. He had been trying to spot a rare type of bird, called the bluebird, for months. After numerous attempts, he finally spotted one sitting on a tree branch and was delighted. So, he sat down and prepared his camera to take the photo, but as he wanted to take the picture, the bird flew away. As Joe was staying there staring at the empty branch, the bird flew back.", "choice": ["Delight", "Disappointment", "Anger", "Pessimism", "Remorse", "Anticipation"]}
{"id": 10, "subject": "Ella", "context": "Ella was up the entire night working on her painting for the art exhibition. She was full of doubt, questioning whether it was good enough or not for the public. As she finished and stepped away, her little brother walked into the room. He stood there, stared at the painting for a while, then he turned to Ella with wide eyes and a big smile on his face.", "choice": ["Relief", "Fear", "Trust", "Disapproval", "Sadness", "Sentimental"]}
{"id": 11, "subject": "Mira", "context": "Mira had always been afraid of dogs. One day, while walking in her neighborhood, she saw an injured puppy on the sidewalk. She cautiously approached, quickly wrapped it in her scarf, and took it to the vet. A few weeks of visits later, Mira found herself getting attached to the creature.", "choice": ["Fear", "Love", "Nervousness", "Disgust", "Disappointment", "Hopeful"]}
{"id": 12, "subject": "Lena", "context": "Lena has been trying to study hard the entire week for her crucial medical exam, but has not found the chance because of her social life. So, with high anxiety, she decided to prepare hours away from the exam. In the middle of her study, she got a notification about the cancellation of the exam due to a virus outbreak in her college.", "choice": ["Nervousness", "Relief", "Pride", "Guilt", "Anticipation", "Amusement"]}
{"id": 13, "subject": "Roger", "context": "After waiting for almost two hours for his date, Roger was considering leaving when he heard a familiar voice behind him. It was his date, Jessica, who frantically apologized for being late and explained she had been helping a family stuck on the highway.", "choice": ["Disappointment", "Admiration", "Anger", "Embarrassment", "Gratitude", "Remorse"]}
{"id": 14, "subject": "Jessica", "context": "After waiting for almost two hours for his date, Roger was considering leaving when he heard a familiar voice behind him. It was his date, Jessica, who frantically apologized for being late and explained she had been helping a family stuck on the highway.", "choice": ["Guilt", "Gratitude", "Trust", "Curiosity", "Amusement", "Disapproval"]}
{"id": 15, "subject": "Tom", "context": "James and Tom are coworkers. They've been best friends for over a decade. Their boss gives out an employee of the year award every year. This year, they both applied as candidates for this reward and worked hard to get it. The results were announced yesterday. James won the award. When they found out, James smiled at first but didn't celebrate.", "choice": ["Disappointment & Remorse", "Pride & Remorse", "Disappointment & Indifferent", "Disappointment & Admiration", "Amusement & Indifferent", "Admiration & Pride"]}
{"id": 16, "subject": "James", "context": "James and Tom are coworkers. They've been best friends for over a decade. Their boss gives out an employee of the year award every year. This year, they both applied as candidates for this reward and worked hard to get it. The results were announced yesterday. James won the award. When they found out, James smiled at first but didn't celebrate.", "choice": ["Sadness & Pride", "Disapproval & Embarrassment", "Sadness & Nervousness", "Pride & Nervousness", "Embarrassment & Nervousness", "Anger & Nervousness"]}
{"id": 17, "subject": "Mike", "context": "Mike had a math exam yesterday. The night before, Mike had studied all the material he could get his hands on and did many practice tests. But when it came to the actual exam, he had forgotten many of the things that he had reviewed. After the exam was over, Mike felt so bad he thought he would fail even though he studied really hard. The results came out today. Mike passed with a low mark, so he will ask the teacher if he can get a higher grade.", "choice": ["Embarrassment & Pride", "Relief & Disappointment", "Pride & Excitement", "Relief & Delight", "Embarrassment & Excitement", "Disappointment & Pride"]}
{"id": 18, "subject": "Charlene", "context": "Charlene is a big fan of Taylor Swift. She has been saving up her allowance for a year to go to her concert. One day, as she was sitting in a cafe, she decided to try buying a Taylor Swift concert ticket. She knew there was a long waitlist of people wanting to go to the concert, but she still gave it a try. After around thirty minutes, she became one of the few to buy the tickets. She screamed the moment she received the email for her purchase confirmation. Immediately after, she realized what she had done and apologized to the other customers.", "choice": ["Excitement & Pride & Embarrassment", "Nervousness & Delight & Embarrassment", "Nervousness & Pride & Delight", "Excitement & Embarrassment & Hopeless", "Excitement & Nervousness & Delight", "Excitement & Delight & Embarrassment"]}
{"id": 19, "subject": "Naomi", "context": "Naomi just graduated high school and is about to attend college abroad in three days. This is the first time she is separated from her family and has to live on her own. While packing, although she's grown up and doesn't play with toys anymore, Naomi brought a doll that her mother gave her as a child.", "choice": ["Sadness & Hopeless & Embarrassment", "Sadness & Nervousness & Hopeless", "Excitement & Sadness & Embarrassment", "Nervousness & Annoyance & Embarrassment", "Excitement & Nervousness & Annoyance", "Excitement & Sadness & Nervousness"]}
{"id": 20, "subject": "Jennie", "context": "Jennie applied to eight different universities to pursue her Bachelor's degree. Each decision letter came in differing dates. Jennie waited until she received all the decision letters and opened them simultaneously. After opening the letters, Jennie found that five of the universities, including her dream university, rejected her. Yet, one of the other three had offered to provide a full scholarship.", "choice": ["Annoyance & Disappointment & Pride", "Annoyance & Pride & Relief", "Disappointment & Hopeless & Embarrassment", "Disappointment & Pride & Embarrassment", "Disappointment & Pride & Hopeless", "Disappointment & Relief & Hopeless"]}
{"id": 21, "subject": "Rayna", "context": "Rayna had a challenging physics exam today. Yet, Rayna was well prepared. Rayna answered most of the questions in the exam in a short amount of time and was sure of her answers. However, when Rayna got to the last question, she could not figure out a solution and ended up spending the rest of the exam on it. The moment Rayna came out of the exam hall and started discussing the questions with her friends, she suddenly came up with a solution for the question.", "choice": ["Relief & Pride & Nervousness", "Relief & Annoyance & Guilt", "Remorse & Annoyance & Pride", "Annoyance & Guilt & Pride", "Remorse & Pride & Nervousness", "Remorse & Relief & Annoyance"]}
{"id": 22, "subject": "Taylor", "context": "Taylor had to complete a group project for the human-computer interaction course. The teams were assigned randomly, and Taylor was excited about meeting new teammates. During weeks of working on the project, he realized he was the only one doing the work, and none of his teammates were willing to help. After all projects were submitted and assessed, his group's project was selected as the best and got the highest mark.", "choice": ["Pride & Remorse", "Pride & Annoyance", "Disappointment & Remorse", "Pride & Embarrassment", "Embarrassment & Remorse", "Disappointment & Hopeless"]}
{"id": 23, "subject": "Laura", "context": "Laura owns a bakery. She recently got a chance to compete in a high-profile national baking competition. After weeks of grueling preparation, she made it to the final round but unfortunately finished in second place. Despite this, she was praised for her work by her baking idol, a renowned pastry chef.", "choice": ["Disappointment & Delight", "Delight & Hopeful", "Nervousness & Pride", "Delight & Sadness", "Sadness & Pride", "Disappointment & Hopeful"]}
{"id": 24, "subject": "Ben", "context": "Ben has been aiming to buy his dream car for many years. He has saved up every single penny he could save from his salary and even did extra part-time jobs for this. After years of hard work, he finally had enough money to buy his dream car. The day he went to buy the car, as he was on his way to the dealership, he noticed a homeless man on the road in dire need of help. Ben helped the man with a considerable part of his savings so that he could start a new life.", "choice": ["Caring & Amusement", "Caring & Embarrassment", "Caring & Disgust", "Hopeless & Disgust", "Caring & Sadness", "Embarrassment & Disgust"]}
{"id": 25, "subject": "Patrick", "context": "Patrick is a passionate soccer player on his high school team. For the whole year, he has been practicing hard to win the championship. On the final day of the match, his leg gets injured. Yet, he still decides to finish the game. Surprisingly, Patrick scored the final goal, leading the team to victory. However, after the match, he found out that his injury needed numerous weeks of medical rest.", "choice": ["Gratitude & Guilt", "Hopeless & Guilt", "Pride & Hopeless", "Sentimental & Guilt", "Pride & Sentimental", "Pride & Nervousness"]}
{"id": 26, "subject": "Lora", "context": "Lora left her husband with her toddler to go grocery shopping. When she got back home, she saw her husband with her toddler on top of his chest, sleeping on the couch, before noticing the mess in the living room.", "choice": ["Annoyance & Nervousness", "Disapproval & Guilt", "Love & Annoyance", "Annoyance & Disapproval", "Disapproval & Nervousness", "Love & Guilt"]}
{"id": 27, "subject": "Alexa", "context": "Every evening, Alexa used to water her vegetable garden, which was in the backyard of her home. One evening, a group of children playing soccer in the nearby ground accidentally kicked the ball into her garden, damaging some of her plants. Alexa destroyed their ball to show her anger. The following afternoon, she saw the children arrive with new plants, apologizing for their actions and asking if they could have their ball back.", "choice": ["Gratitude & Joy", "Anger & Gratitude", "Anger & Disapproval", "Joy & Hopeless", "Disapproval & Joy", "Gratitude & Guilt"]}
{"id": 28, "subject": "the children", "context": "Every evening, Alexa used to water her vegetable garden, which was in the backyard of her home. One evening, a group of children playing soccer in the nearby ground accidentally kicked the ball into her garden, damaging some of her plants. Alexa destroyed their ball to show her anger. The following afternoon, she saw the children arrive with new plants, apologizing for their actions and asking if they could have their ball back.", "choice": ["Embarrassment & Oblivious", "Fear & Oblivious", "Anger & Pride", "Disappointment & Oblivious", "Embarrassment & Fear", "Embarrassment & Anger"]}
{"id": 29, "subject": "Gabriel", "context": "Gabriel has had a long and tough day. He woke up early to go to work, got shouted at by his boss, and was laughed at by his coworkers. Then, he found that he might need to find a new job due to his recent failures. On his way home, Gabriel bought an ice cream to make himself feel better, but it fell to the ground right as he wanted to start eating it. Then, he started laughing hysterically.", "choice": ["Sadness", "Joy", "Delight", "Disapproval", "Embarrassment", "Gratitude"]}
{"id": 30, "subject": "Clai", "context": "When Clai was about to graduate from college, Michi, her best friend, told her that she wasn't able to come to her graduation. During the graduation day, Clai was walking down the stage to receive her diploma when suddenly she heard loud cheering and saw Michi.", "choice": ["Sadness", "Disapproval", "Hopeless", "Anger", "Anticipation", "Delight"]}
{"id": 31, "subject": "Michi", "context": "When Clai was about to graduate from college, Michi, her best friend, told her that she wasn't able to come to her graduation. During the graduation day, Clai was walking down the stage to receive her diploma when suddenly she heard loud cheering and saw Michi.", "choice": ["Pride", "Caring", "Guilt", "Disappointment", "Unbothered", "Embarrassment"]}
{"id": 32, "subject": "Rea", "context": "Rea is disliked by her classmates due to her high grades. Last week, their class had a very challenging chemistry test. When the papers were graded and handed out, Rea realized that she was the only student who passed the test among her classmates. So, she immediately tore her test paper and threw it out before anyone else saw it.", "choice": ["Pride", "Nervousness", "Hopeless", "Anger", "Gratitude", "Delight"]}
{"id": 33, "subject": "Rea's Classmates", "context": "Rea is disliked by her classmates due to her high grades. Last week, their class had a very challenging chemistry test. When the papers were graded and handed out, Rea realized that she was the only student who passed the test among her classmates. So, she immediately tore her test paper and threw it out before anyone else saw it.", "choice": ["Anger", "Surprise", "Disapproval", "Annoyance", "Nervousness", "Oblivious"]}
{"id": 34, "subject": "Ella", "context": "Ella gave her daughter Ada a music box for her 6th birthday, it played her favorite classical songs. Ada loved the music box and used to listen to it every night before bed. When Ada turned 10, she accidentally broke the music box. So, she hid the broken box and never mentioned the incident to Ella. One day, while cleaning, Ella found the broken music box and comforted Ada telling her that accidents happen.", "choice": ["Acceptance", "Disgust", "Guilt", "Embarrassment", "Anger", "Surprise"]}
{"id": 35, "subject": "Ada", "context": "Ella gave her daughter Ada a music box for her 6th birthday, it played her favorite classical songs. Ada loved the music box and used to listen to it every night before bed. When Ada turned 10, she accidentally broke the music box. So, she hid the broken box and never mentioned the incident to Ella. One day, while cleaning, Ella found the broken music box and comforted Ada telling her that accidents happen.", "choice": ["Sadness & Joy & Anger", "Guilt & Joy & Anger", "Guilt & Relief & Joy", "Guilt & Sadness & Sentimental", "Joy & Anger & Sentimental", "Guilt & Sadness & Relief"]}
{"id": 36, "subject": "Elise", "context": "Elise and Damon had been the best of friends since their high school days. Recently, Elise developed feelings for Damon and decided to confess. She rehearsed and finally, with her heart pounding, she confessed her feelings. Damon told her he had been in a relationship with someone else for a couple of months. Elise congratulated him and left hurriedly.", "choice": ["Disappointment & Jealousy", "Anticipation & Sentimental", "Anticipation & Gratitude", "Gratitude & Sentimental", "Jealousy & Sentimental", "Jealousy & Gratitude"]}
{"id": 37, "subject": "Damon", "context": "Elise and Damon had been the best of friends since their high school days. Recently, Elise developed feelings for Damon and decided to confess. She rehearsed and finally, with her heart pounding, she confessed her feelings. Damon told her he had been in a relationship with someone else for a couple of months. Elise congratulated him and left hurriedly.", "choice": ["Guilt & Hopeless", "Surprise & Anger", "Surprise & Pride", "Hopeless & Pride", "Surprise & Guilt", "Guilt & Disapproval"]}
{"id": 38, "subject": "Diana", "context": "Diana was a self-taught artist, while her sister Eliana has been going to classes since she was a child. Eliana often criticized Diana for her lack of creativity. One day, Eliana entered a prestigious photo contest and lost. She then found out that Diana had won the same contest with her artwork. So, she went online to write comments on how the judges do not understand art.", "choice": ["Pride", "Guilt", "Jealousy", "Gratitude", "Hopeless", "Admiration"]}
{"id": 39, "subject": "Eliana", "context": "Diana was a self-taught artist, while her sister Eliana has been going to classes since she was a child. Eliana often criticized Diana for her lack of creativity. One day, Eliana entered a prestigious photo contest and lost. She then found out that Diana had won the same contest with her artwork. So, she went online to write comments on how the judges do not understand art.", "choice": ["Disapproval", "Anticipation", "Remorse", "Admiration", "Excitement", "Love"]}
{"id": 40, "subject": "Alice", "context": "Alice had been working for a long time to afford the car of her dreams. After a lot of saving up, she was able to buy it today. Meanwhile, her brother Bill was going through financial struggles and had to sell his car a few weeks ago. Alice decided to take Bill for a ride in her new car that evening.", "choice": ["Excitement", "Sentimental", "Guilt", "Disapproval", "Embarrassment", "Gratitude"]}
{"id": 41, "subject": "Bill", "context": "Alice had been working for a long time to afford the car of her dreams. After a lot of saving up, she was able to buy it today. Meanwhile, her brother Bill was going through financial struggles and had to sell his car a few weeks ago. Alice decided to take Bill for a ride in her new car that evening.", "choice": ["Sadness", "Excitement", "Remorse", "Disappointment", "Hopeless", "Guilt"]}
{"id": 42, "subject": "Jane", "context": "Jane's mother is very strict and always undermines her accomplishments at home. One day, Jane showed her mother the test paper on which she had scored 95 points out of 100. Her mother only said that she should have gotten full marks on such a simple test. However, when other parents are present, she openly talks about Jane's grades and excitedly praises her daughter.", "choice": ["Love", "Gratitude", "Amusement", "Jealousy", "Loathe", "Sentimental"]}
{"id": 43, "subject": "Jane's mother", "context": "Jane's mother is very strict and always undermines her accomplishments at home. One day, Jane showed her mother the test paper on which she had scored 95 points out of 100. Her mother only said that she should have gotten full marks on such a simple test. However, when other parents are present, she openly talks about Jane's grades and excitedly praises her daughter.", "choice": ["Admiration", "Disappointment", "Jealousy", "Disgust", "Anger", "Nervousness"]}
{"id": 44, "subject": "Shawn", "context": "Angie and Shawn are a very close couple, but they haven't been on the best terms for the last two weeks. Today is the 28th. On this day of every month, Shawn would buy a bouquet of flowers and put them in the living room to express his love for Angie. As Shawn passed by the flower shop, he started pondering deeply, and after some time, he walked in to buy a bouquet.", "choice": ["Guilt & Anger", "Sentimental & Hopeless", "Sentimental & Guilt", "Sentimental & Anger", "Guilt & Hopeless", "Caring & Sentimental"]}
{"id": 45, "subject": "Victoria", "context": "The result of the hard chemistry test is finally out today. Victoria found out that, while she didn't pass the test, she earned a higher score than Bertha, her rival.", "choice": ["Disappointment & Pride", "Jealousy & Nervousness", "Excitement & Hopeless", "Pride & Jealousy", "Disappointment & Excitement", "Pride & Excitement"]}
{"id": 46, "subject": "Bertha", "context": "The result of the hard chemistry test is finally out today. Victoria found out that, while she didn't pass the test, she earned a higher score than Bertha, her rival.", "choice": ["Disappointment & Jealousy", "Jealousy & Hopeless", "Pride & Nervousness", "Pride & Jealousy", "Excitement & Jealousy", "Disappointment & Pride"]}
{"id": 47, "subject": "Andre", "context": "Andre is a doctor. Due to the constant emergencies happening in the past few months, Andre hasn't had the time to be with his girlfriend. So, this weekend, he decided to take his girlfriend on a romantic date night. Nearing the end of the main course, he got a call from his friend at the hospital telling him to enjoy the night.", "choice": ["Delight", "Embarrassment", "Nervousness", "Disappointment", "Guilt", "Pride"]}
{"id": 48, "subject": "Harvey", "context": "Today was a hectic day for Harvey. He woke up late to go to the office, skipped his breakfast, got scolded by his manager, had to work late, and ate one meal only. When he came home, he wanted to get to bed immediately when he saw his parents' morning text that he had been unable to check until now, wishing him the happiest birthday and leaving heartfelt messages.", "choice": ["Disappointment & Gratitude", "Annoyance & Gratitude", "Sadness & Gratitude", "Remorse & Anger", "Sadness & Disappointment", "Annoyance & Anger"]}
{"id": 49, "subject": "Zhongli", "context": "To celebrate moving into his new house, Zhongli hosted a housewarming party and invited one of his best friends, Ollie. Around 6 p.m., Ollie arrived at Zhongli's house and entered without taking off his shoes. Seeing this, Zhongli told him to take off his shoes and offered a pair of slippers to use inside the house.", "choice": ["Hopeful & Curiosity", "Annoyance & Joy", "Annoyance & Gratitude", "Disapproval & Annoyance", "Disapproval & Hopeful", "Joy & Curiosity"]}
{"id": 50, "subject": "Ollie", "context": "To celebrate moving into his new house, Zhongli hosted a housewarming party and invited one of his best friends, Ollie. Around 6 p.m., Ollie arrived at Zhongli's house and entered without taking off his shoes. Seeing this, Zhongli told him to take off his shoes and offered a pair of slippers to use inside the house.", "choice": ["Gratitude", "Annoyance", "Embarrassment", "Sentimental", "Sadness", "Anger"]}
{"id": 51, "subject": "Amy", "context": "Samira and Amy decided to get dinner together at an Indian restaurant. Amy is American and has never had Indian Food. They came to this restaurant because Samira wanted Amy to try her culture and food. Once the food arrived, Samira started eating with her hands and mentioned how it reminded her of her mom's cooking.", "choice": ["Disgust & Anger", "Fear & Pessimism", "Pessimism & Anticipation", "Disapproval & Anger", "Disapproval & Disgust", "Disgust & Fear"]}
{"id": 52, "subject": "Samira", "context": "Samira and Amy decided to get dinner together at an Indian restaurant. Amy is American and has never had Indian Food. They came to this restaurant because Samira wanted Amy to try her culture and food. Once the food arrived, Samira started eating with her hands and mentioned how it reminded her of her mom's cooking.", "choice": ["Joy", "Embarrassment", "Nervousness", "Pride", "Disgust", "Disapproval"]}
{"id": 53, "subject": "Jessica", "context": "On her trip to Japan, Jessica visited a sushi place with many good reviews. She ordered many items on the menu for herself and enjoyed her dinner to the fullest. Then, she asked for the receipt and put in a generous twenty-dollar tip. After noticing the tip, the waitress took it and returned it to Jessica.", "choice": ["Anticipation & Embarrassment", "Embarrassment & Surprise", "Anticipation & Surprise", "Joy & Surprise", "Anticipation & Joy", "Disgust & Embarrassment"]}
{"id": 54, "subject": "the sushi waitress", "context": "On her trip to Japan, Jessica visited a sushi place with many good reviews. She ordered many items on the menu for herself and enjoyed her dinner to the fullest. Then, she asked for the receipt and put in a generous twenty-dollar tip. After noticing the tip, the sushi waitress took it and returned it to Jessica.", "choice": ["Admiration", "Jealousy", "Sentimental", "Embarrassment", "Disapproval", "Anger"]}
{"id": 55, "subject": "Weili", "context": "Weili recently came over to Germany from China for a student exchange program. Earlier today, Samantha, her German classmate, invited her to a movie that started at half past seven. In Europe, unlike China, movies usually start twenty to thirty minutes late. Weili showed up at the cinema at around eight but Samantha didn't mention anything about it.", "choice": ["Unbothered", "Disapproval", "Embarrassment", "Annoyance", "Nervousness", "Joy"]}
{"id": 56, "subject": "Samantha", "context": "Weili recently came over to Germany from China for a student exchange program. Earlier today, Samantha, her German classmate, invited her to a movie that started at half past seven. In Europe, unlike China, movies usually start twenty to thirty minutes late. Weili showed up at the cinema at around eight but Samantha didn't mention anything about it.", "choice": ["Unbothered", "Disapproval", "Embarrassment", "Annoyance", "Nervousness", "Joy"]}
{"id": 57, "subject": "Xiaofeng", "context": "Xiaofeng, who is from China, and his friends usually don't go Dutch when eating out and instead have one of them pay the bill. One day, he brought Henry, his American friend, to a dinner party. After the meal, Henry naturally took out his credit card and prepared to split the bill. Xiaofeng smiled and refused.", "choice": ["Surprise", "Caring", "Annoyance", "Embarrassment", "Fear", "Disapproval"]}
{"id": 58, "subject": "Henry", "context": "Xiaofeng, who is from China, and his friends usually don't go Dutch when eating out and instead have one of them pay the bill. One day, he brought Henry, his American friend, to a dinner party. After the meal, Henry naturally took out his credit card and prepared to split the bill. Xiaofeng smiled and refused.", "choice": ["Excitement", "Disgust", "Sadness", "Guilt", "Anticipation", "Surprise"]}
{"id": 59, "subject": "Bill", "context": "Bill was learning how to use chopsticks from his Chinese friend, Xiao. After several attempts, Bill finally successfully picked up a handful of rice with his chopstick and after eating the rice, he put the chopsticks upright inside the rice bowl. Xiao immediately took the chopsticks out and put them on the chopsticks rest.", "choice": ["Admiration", "Disapproval", "Annoyance", "Remorse", "Delight", "Excitement"]}
{"id": 60, "subject": "Xiao", "context": "Bill was learning how to use chopsticks from his Chinese friend, Xiao. After several attempts, Bill finally successfully picked up a handful of rice with his chopstick and after eating the rice, he put the chopsticks upright inside the rice bowl. Xiao immediately took the chopsticks out and put them on the chopsticks rest.", "choice": ["Admiration & Disapproval", "Disapproval & Remorse", "Remorse & Excitement", "Admiration & Excitement", "Admiration & Annoyance", "Annoyance & Delight"]}
{"id": 61, "subject": "Li", "context": "Alexandra had a meeting with Chinese supervisor, Li. In this meeting, she straightforwardly pointed out the flaws in Li's presentation and told her the mistakes she had made.", "choice": ["Oblivious", "Gratitude", "Embarrassment", "Disapproval", "Pride", "Nervousness"]}
{"id": 62, "subject": "Fatemeh", "context": "Fatemeh, an Iranian student studying in the US, invited her classmate Janice over for lunch. As per Iranian tradition, Fatemeh immediately offered Janice slippers to wear inside the house, which Janice politely declined, saying she prefers her own shoes.", "choice": ["Embarrassment", "Joy", "Pride", "Disapproval", "Acceptance", "Gratitude"]}
{"id": 63, "subject": "Janice", "context": "Fatemeh, an Iranian student studying in the US, invited her classmate Janice over for lunch. As per Iranian tradition, Fatemeh immediately offered Janice slippers to wear inside the house, which Janice politely declined, saying she prefers her own shoes.", "choice": ["Annoyance & Relief", "Annoyance & Oblivious", "Relief & Oblivious", "Guilt & Gratitude", "Gratitude & Oblivious", "Disapproval & Gratitude"]}
{"id": 64, "subject": "Marcus", "context": "During a business meeting in Saudi Arabia, American entrepreneur Marcus initiated a handshake with Saudi businesswoman Ayah. However, Ayah simply nodded her head instead and placed her hand over her heart.", "choice": ["Annoyance", "Disappointment", "Amusement", "Embarrassment", "Relief", "Hopeless"]}
{"id": 65, "subject": "Ayah", "context": "During a business meeting in Saudi Arabia, American entrepreneur Marcus initiated a handshake with Saudi businesswoman Ayah. However, Ayah simply nodded her head instead and placed her hand over her heart.", "choice": ["Oblivious", "Disapproval", "Anger", "Remorse", "Acceptance", "Pride"]}
{"id": 66, "subject": "Lucia", "context": "On her visit to China from the US, Lucia was invited by her new Chinese coworker, Ling, to a dinner gathering with friends. When it was time to order, Ling ordered for the whole table and gave back the menu before Lucia could have a look. When the food was served, Lucia looked at the dishes and said \"I can take this one,\" before choosing one of the dishes to eat.", "choice": ["Disappointment & Jealousy", "Oblivious & Joy", "Oblivious & Disappointment", "Sadness & Jealousy", "Joy & Jealousy", "Annoyance & Jealousy"]}
{"id": 67, "subject": "Ling", "context": "On her visit to China from the US, Lucia was invited by her new Chinese coworker, Ling, to a dinner gathering with friends. When it was time to order, Ling ordered for the whole table and gave back the menu before Lucia could have a look. When the food was served, Lucia looked at the dishes and said \"I can take this one,\" before choosing one of the dishes to eat.", "choice": ["Joy & Jealousy", "Disapproval & Sadness", "Joy & Sadness", "Annoyance & Disapproval", "Oblivious & Disapproval", "Annoyance & Oblivious"]}
{"id": 68, "subject": "Lincoln", "context": "Due to higher pay, Lincoln moved from the US to Dubai in Ramadan. On his first day at work, He suggested a team meeting over lunch with his new coworker, Ali, to know each other better. However, Ali responded with a direct \"No\" without any further explanation.", "choice": ["Disapproval & Anger", "Oblivious & Embarrassment", "Oblivious & Disapproval", "Anger & Sadness", "Annoyance & Disapproval", "Oblivious & Sadness"]}
{"id": 69, "subject": "Ali", "context": "Due to higher pay, Lincoln moved from the US to Dubai in Ramadan. On his first day at work, He suggested a team meeting over lunch with his new coworker, Ali, to know each other better. However, Ali responded with a direct \"No\" without any further explanation.", "choice": ["Disgust", "Disapproval", "Fear", "Nervousness", "Anger", "Indifferent"]}
{"id": 70, "subject": "Sophia", "context": "During her visit to India, Sophia became close to Laila, her Indian Coworker, and was invited to attend her birthday party. As she wanted to stand out, she wore her favorite white dress. When Laila saw Sophia, she told her what her dress indicated.", "choice": ["Embarrassment", "Joy", "Excitement", "Oblivious", "Gratitude", "Nervousness"]}
{"id": 71, "subject": "Laila", "context": "During her visit to India, Sophia became close to Laila, her Indian Coworker, and was invited to attend her birthday party. As she wanted to stand out, she wore her favorite white dress. When Laila saw Sophia, she gently went up to her and told her what her dress indicated.", "choice": ["Gratitude", "Disappointment", "Annoyance", "Disgust", "Acceptance", "Guilt"]}
{"id": 72, "subject": "Jason", "context": "Before passing away, Max's grandmother gave him a ring that had been passed down generations in their family. She told him that he may pass it down to his children one day. Yesterday, Max's friend, Jason, borrowed the ring to include it in his family values and heritage presentation. After the presentation, he couldn't find the ring, no matter how hard he looked. So, he offered Max to buy him a similar ring in return.", "choice": ["Embarrassment", "Annoyance", "Indifferent", "Curiosity", "Amusement", "Anticipation"]}
{"id": 73, "subject": "Max", "context": "Before passing away, Max's grandmother gave him a ring that had been passed down generations in their family. She told him that he may pass it down to his children one day. Yesterday, Max's friend, Jason, borrowed the ring to include it in his family values and heritage presentation. After the presentation, he couldn't find the ring, no matter how hard he looked. So, he offered Max to buy him a similar ring in return.", "choice": ["Disapproval & Embarrassment", "Gratitude & Embarrassment", "Caring & Embarrassment", "Disapproval & Delight", "Gratitude & Delight", "Annoyance & Disapproval"]}
{"id": 74, "subject": "Jason", "context": "Jason was going on a date last week and desperately needed a formal shirt. Jason asked George if he could borrow George's. George lent Jason his favorite shirt, which George thought was irreplaceable since it was given to him by his mother. During the date, Jason got some cake on the shirt and couldn't wash it off. Jason looked it up, and it turns out Jason could buy the same shirt for a couple of bucks. So, Jason decided just to buy George a new shirt to replace it. Jason bet he won't mind.", "choice": ["Embarrassment", "Caring", "Sentimental", "Joy", "Disapproval", "Unbothered"]}
{"id": 75, "subject": "George", "context": "Jason was going on a date last week and desperately needed a formal shirt. Jason asked George if he could borrow George's. George lent Jason his favorite shirt, which George thought was irreplaceable since it was given to him by his mother. During the date, Jason got some cake on the shirt and couldn't wash it off. Jason looked it up, and it turns out Jason could buy the same shirt for a couple of bucks. So, Jason decided just to buy George a new shirt to replace it. Jason bet he won't mind.", "choice": ["Gratitude & Guilt", "Disappointment & Guilt", "Anger & Disappointment", "Gratitude & Embarrassment", "Embarrassment & Guilt", "Unbothered & Disappointment"]}
{"id": 76, "subject": "Penny", "context": "Yesterday, right before Penny's exam, Penny realized she didn't bring any pens to take the exam. Penny asked her friend Kevin if she could borrow one of his. Kevin gave Penny a pen and told her she could keep it after the exam since he had many. When Penny returned home after the exam, Penny realized she had lost Kevin's pen. Penny looked everywhere, but couldn't find it. When Penny met Kevin today, Penny asked Kevin how much he paid for it so she could give him the money.", "choice": ["Sentimental", "Embarrassment", "Guilt", "Delight", "Remorse", "Jealousy"]}
{"id": 77, "subject": "Kevin", "context": "Yesterday, right before Penny's exam, Penny realized she didn't bring any pens to take the exam. Penny asked her friend Kevin if she could borrow one of his. Kevin gave Penny a pen and told her she could keep it after the exam since he had many. When Penny returned home after the exam, Penny realized she had lost Kevin's pen. Penny looked everywhere, but couldn't find it. When Penny met Kevin today, Penny asked Kevin how much he", "choice": ["Disapproval & Annoyance", "Annoyance & Gratitude", "Unbothered & Guilt", "Sadness & Annoyance", "Disapproval & Gratitude", "Unbothered & Gratitude"]}
{"id": 78, "subject": "Hannah", "context": "Hannah is a massive fan of the Backstreet Boys. She had a poster hanging on her room's wall and had it signed when she went to the fan meeting with them. One day, Hannah and her sister were studying together in her room. Accidentally, her sister ripped the poster. Thinking it was just a poster, her sister offered to buy a new one.", "choice": ["Jealousy & Embarrassment", "Disappointment & Embarrassment", "Anger & Gratitude", "Gratitude & Jealousy", "Anger & Disappointment", "Anger & Embarrassment"]}
{"id": 79, "subject": "Hannah's sister", "context": "Hannah is a massive fan of the Backstreet Boys. She had a poster hanging on her room's wall and had it signed when she went to the fan meeting with them. One day, Hannah and her sister were studying together in her room. Accidentally, her sister ripped the poster. Thinking it was just a poster, her sister offered to buy a new one.", "choice": ["Disgust", "Joy", "Jealousy", "Nervousness", "Embarrassment", "Unbothered"]}
{"id": 80, "subject": "Jennie", "context": "Jennie come from a poor family. One day, after being accepted to the university, her family congratulated her and gifted her with a bag for the first time. 9 years later, Jennie's husband and she moved houses after getting married. While unpacking, Jennie's husband found a bag that was torn and dirty. Jennie's parents gave her that bag as a gift for getting accepted into her dream university. Jennie's husband wanted to throw it away and said Jennie wouldn't need it since it's useless.", "choice": ["Annoyance & Disapproval & Gratitude", "Sentimental & Disapproval & Delight", "Gratitude & Delight & Disgust", "Annoyance & Disapproval & Delight", "Sentimental & Annoyance & Disapproval", "Sentimental & Gratitude & Disgust"]}
{"id": 81, "subject": "Jennie's husband", "context": "Jennie come from a poor family. One day, after being accepted to the university, her family congratulated her and gifted her with a bag for the first time. 9 years later, Jennie's husband and she moved houses after getting married. While unpacking, Jennie's husband found a bag that was torn and dirty. Jennie's parents gave her that bag as a gift for getting accepted into her dream university. Jennie's husband wanted to throw it away and said Jennie wouldn't need it since it's useless.", "choice": ["Oblivious & Disgust", "Sentimental & Curiosity", "Oblivious & Caring", "Sadness & Curiosity", "Oblivious & Sentimental", "Caring & Disgust"]}
{"id": 82, "subject": "Mr Jenkins", "context": "After 50 years of hard work, Mr Jenkins, a beloved history teacher at their old high school, is retiring. To commemorate the occasion, all his past and present students decided to gather for a surprise party. They dug out all their history notes, letters, and even grades that Mr. Jenkins had given them over the years. They used these to create a colourful and informative mural, telling the story of his impact on their lives.", "choice": ["Anticipation & Guilt", "Anticipation & Sadness", "Gratitude & Guilt", "Sadness & Sentimental", "Anticipation & Sentimental", "Gratitude & Sentimental"]}
{"id": 83, "subject": "Josh", "context": "After cleaning his attic, Josh stumbled upon an old wristwatch that his father used to wear when Josh was only a child. The watch was an ordinary device, and while it was scratched and worn, Josh decided not to throw it away.", "choice": ["Sentimental", "Disgust", "Sadness", "Joy", "Curiosity", "Nervousness"]}
{"id": 84, "subject": "Nick", "context": "It's been a long time since Nick visited the park where he spent his childhood days. So, he planned a visit and took his young son, Phil. On the way, they crossed the old tree where Nick used to play with his friends. He noticed that his son was looking at the engraved initials on the tree with his eyes wide open.", "choice": ["Sentimental", "Anticipation", "Indifferent", "Disapproval", "Hopeful", "Nervousness"]}
{"id": 85, "subject": "Phil", "context": "It's been a long time since Nick visited the park where he spent his childhood days. So, he planned a visit and took his young son, Phil. On the way, they crossed the old tree where Nick used to play with his friends. He noticed that his son was looking at the engraved initials on the tree with his eyes wide open.", "choice": ["Sentimental", "Gratitude", "Annoyance", "Amusement", "Disapproval", "Curiosity"]}
{"id": 86, "subject": "Alan", "context": "Alan accidentally left behind his son's favorite soft toy at a park. Instead of going to the mall to buy a new one, he hurried back to retrieve it, even though it was just a worn-out bunny toy.", "choice": ["Unbothered", "Hopeless", "Nervousness", "Amusement", "Curiosity", "Disappointment"]}
{"id": 87, "subject": "Helena", "context": "After her breakup, Helena did not want to be reminded of her ex. While cleaning up her room, she found pieces of a letter in the trash and asked her mom about it. Her mom told her that the letter was from her ex, and she decided to tear it and throw it out.", "choice": ["Anger", "Gratitude", "Disapproval", "Disgust", "Jealousy", "Anticipation"]}
{"id": 88, "subject": "Luna", "context": "Luna has always avoided seeing any hole patterns due to her trypophobia. She usually succeeds in avoiding patterns clustered with holes in them. One day, Luna and her family went to a restaurant for lunch. Once they placed the orders, the waitress served her drink with a straw in it.", "choice": ["Unbothered", "Fear", "Nervousness", "Disgust", "Guilt", "Pessimism"]}
{"id": 89, "subject": "Julie", "context": "Ever since Julie was a child, Julie was so afraid of spiders and hated going to the zoo sections that included these little creatures. Today, Julie had a nice dinner with her best friends and watched the new Spiderman Movie.", "choice": ["Joy", "Sadness", "Fear", "Nervousness", "Disapproval", "Disgust"]}
{"id": 90, "subject": "Molly", "context": "Molly have had acrophobia since Molly was a young child. Today, at work, the elevator was out of order, and Molly had to take the stairs to reach her office. Molly considered it a small exercise since Molly haven't had much time to work out recently. Molly's office is on the last floor of this tall building.", "choice": ["Excitement", "Fear", "Disapproval", "Nervousness", "Hopeless", "Pride"]}
{"id": 91, "subject": "Leo", "context": "Leo have a hard time dealing with people and is very antisocial. Leo can easily get overwhelmed by talking to others. Tonight, after work, Leo spent a lonely night all by himself watching movies.", "choice": ["Fear", "Joy", "Disapproval", "Hopeless", "Pessimism", "Sadness"]}
{"id": 92, "subject": "Andrew", "context": "The last time Andrew went to Disneyland, he fractured his leg on the way to his favorite ride he was running up the steps carelessly. Today, after several requests from his girlfriend, they went to Disneyland and were waiting for the same ride.", "choice": ["Pride", "Fear", "Excitement", "Annoyance", "Surprise", "Disgust"]}
{"id": 93, "subject": "Lin Lin", "context": "As Lin Lin was going back home one night, she came across a pervert who tried to harass her. Fortunately, she ran away just in time. She couldn't remember much about the guy's face, but she remembered that he had a big mole between his eyebrows. A week later, she met a male client with a large mole between his eyebrows at a company reception.", "choice": ["Anticipation", "Disapproval", "Amusement", "Horror", "Pride", "Embarrassment"]}
{"id": 94, "subject": "Ted", "context": "Ted has won the arm wrestling championship for seven years in a row. Ricky, who is new to the game, decides to give it a shot for fun and challenge Ted despite knowing that he will lose. Ricky lost.", "choice": ["Nervousness", "Embarrassment", "Admiration", "Annoyance", "Pride", "Delight"]}
{"id": 95, "subject": "Ricky", "context": "Ted has won the arm wrestling championship for seven years in a row. Ricky, who is new to the game, decides to give it a shot for fun and challenge Ted despite knowing that he will lose. Ricky lost.", "choice": ["Nervousness", "Embarrassment", "Amusement", "Annoyance", "Pride", "Delight"]}
{"id": 96, "subject": "Angela", "context": "Angela has a phobia of bees, and she gets very nervous when there are bees flying around. Today, Kitty gifted her a bottle of honey.", "choice": ["Nervousness", "Fear", "Disapproval", "Disgust", "Gratitude", "Annoyance"]}
{"id": 97, "subject": "Molly", "context": "Molly has always been afraid of darkness due to her Nyctophobia. She effortlessly avoids all unlit places and activities to feel at ease. This evening, Molly and her classmates were assigned an astronomy project that required them to observe stars in the Sahara in the afternoon.", "choice": ["Nervousness", "Fear", "Excitement", "Unbothered", "Gratitude", "Delight"]}
{"id": 98, "subject": "Sophie", "context": "Sophie has always been introverted and never enjoyed large parties or gatherings. She often feels overwhelmed by the noise and prefers quiet activities at home. Today, her best friend persuaded her to go to a salsa dance class with her. At that class, everyone was required to switch partners every five minutes in order to meet and dance with different people.", "choice": ["Joy", "Nervousness", "Curiosity", "Fear", "Disapproval", "Gratitude"]}
{"id": 99, "subject": "Adam", "context": "Adam has claustrophobia and gets extremely uncomfortable in small or crowded spaces. Last night, his friend invited him to his spacious garden home for a barbeque dinner.", "choice": ["Relief & Embarrassment", "Disapproval & Nervousness", "Jealousy & Gratitude", "Relief & Gratitude", "Embarrassment & Jealousy", "Disapproval & Embarrassment"]}
{"id": 100, "subject": "Sam", "context": "Sam, a 45-year-old introverted scientist, has been struggling for years with social anxiety. Today, he is asked to give a speech in front of numerous respected peers about his recent cutting-edge discovery. But, his wife was the only person who showed up to the speech.", "choice": ["Sadness", "Disappointment", "Anger", "Hopeless", "Trust", "Delight"]}
{"id": 101, "subject": "Sara", "context": "Sara has always been very superstitious. Yesterday, despite loving her job, She decided to quit as her office shifted to the 13th floor of her building.", "choice": ["Sadness & Guilt", "Anger & Sentimental", "Relief & Guilt", "Sentimental & Fear", "Relief & Sadness", "Fear & Guilt"]}
{"id": 102, "subject": "Jacob", "context": "Jacob is very organized and likes to schedule events in his Calender. Originally, he and his girlfriend, Stephanie, were planning on a date this afternoon, so he scheduled his whole day around it. At noon, Stephanie messaged him that since She didn't have anything for the day, her friends invited her to a fabulous birthday party that she will go to.", "choice": ["Disappointment", "Delight", "Jealousy", "Embarrassment", "Gratitude", "Curiosity"]}
{"id": 103, "subject": "Stephanie", "context": "Jacob is very organized and likes to schedule events in his Calender. Originally, he and his girlfriend, Stephanie, were planning on a date this afternoon, so he scheduled his whole day around it. At noon, Stephanie messaged him that since She didn't have anything for the day, her friends invited her to a fabulous birthday party that she will go to.", "choice": ["Excitement", "Sentimental", "Guilt", "Gratitude", "Embarrassment", "Disappointment"]}
{"id": 104, "subject": "Catherine", "context": "Catherine, a young aspiring musician, had difficulty finding her voice and often mimicked the style of popular singers. However, she hates copying others and wants to be original. One day, during a live performance, she hit a high note perfectly, just like her favorite artist would, and the crowd clapped and cheered for her. Upon hearing the crowd's cheers, Catherine's eyes welled up with tears.", "choice": ["Disappointment", "Guilt", "Excitement", "Jealousy", "Gratitude", "Sadness"]}
{"id": 105, "subject": "Greg", "context": "Greg was raised in a conservative family. Therefore, Greg did not have much freedom in selecting jobs and applied for a job that could satisfy his family's requirements but not his own. When the decision letter came out, he was rejected by the company and they wished him the best of luck. He sighed.", "choice": ["Admiration", "Embarrassment", "Anger", "Hopeless", "Guilt", "Relief"]}
{"id": 106, "subject": "John", "context": "Professor Adams had instructed John to complete a physics experiment. John, who isn't good at science, tried hard to focus on the experiment. After hours of work, when John completed the experiment, he found out that his result was the expected one. He sighed and called Professor Adams to share his results.", "choice": ["Nervousness", "Disgust", "Surprise", "Disappointment", "Hopeless", "Relief"]}
{"id": 107, "subject": "Professor Adams", "context": "Professor Adams had instructed John to complete a physics experiment. John, who isn't good at science, tried hard to focus on the experiment. After hours of work, when John completed the experiment, he found out that his result was the expected one. He sighed and called Professor Adams to share his results.", "choice": ["Admiration", "Disapproval", "Gratitude", "Relief", "Remorse", "Hopeless"]}
{"id": 108, "subject": "Jenny", "context": "Jenny was dreading going on a blind date that her friend Lauren had set up for her. She didn't know anything about the guy and was worried it would be awkward. When Jenny arrived at the restaurant, she was pleasantly surprised to see an attractive man waiting for her. As they started talking over dinner, Jenny realized they had a lot in common, and she really enjoyed the conversation. At the end of the night, he asked if he could see her again. Jenny sighed and said she would love to.", "choice": ["Disappointment & Hopeless", "Relief & Excitement", "Excitement & Hopeless", "Disappointment & Guilt", "Jealousy & Disappointment", "Jealousy & Guilt"]}
{"id": 109, "subject": "Irene", "context": "Irene wanted to skip class, so she sniffled and groaned in pain in front of the teacher. The teacher excused her from the class and asked her to go to the infirmary.", "choice": ["Joy", "Disapproval", "Annoyance", "Sadness", "Guilt", "Pride"]}
{"id": 110, "subject": "Alex", "context": "While being best friends, Alex and Charlie support different soccer teams. So, when it was time for their favorite teams to play against each other, they gathered in a bar to watch the match. Alex's team was dominant during the whole game and was winning until the last minute, when Charlie's team scored a sudden goal to win the match. At this moment, both Alex and Charlie started to shout.", "choice": ["Nervousness", "Anticipation", "Excitement", "Disappointment", "Delight", "Pride"]}
{"id": 111, "subject": "Charlie", "context": "While being best friends, Alex and Charlie support different soccer teams. So, when it was time for their favorite teams to play against each other, they gathered in a bar to watch the match. Alex's team was dominant during the whole game and was winning until the last minute, when Charlie's team scored a sudden goal to win the match. At this moment, both Alex and Charlie started to shout.", "choice": ["Nervousness", "Anticipation", "Caring", "Disappointment", "Delight", "Pride"]}
{"id": 112, "subject": "Analia", "context": "Analia had worked really hard on her comedy sketch and performed her standup last night in front of many people. Before her turn, she was very nervous to get on the stage. Once she started to tell some jokes, you could hear the audience crying from two blocks away.", "choice": ["Embarrassment", "Curiosity", "Guilt", "Delight", "Disappointment", "Excitement"]}
{"id": 113, "subject": "Natalie", "context": "While standing in the cold, Natalie, who was under-dressed, went to an outdoor coffee shop to buy a cup of hot cocoa, which she craved deeply. Her voice was trembling when she was ordering and sighed as she took the first sip.", "choice": ["Fear", "Nervousness", "Joy", "Anticipation", "Gratitude", "Pride"]}
{"id": 114, "subject": "Arnold", "context": "Arnold has spent the last week working on a bug in his program. His boss has been pressuring him to fix it, but he has no idea what part of the code is wrong. So, he tried to explain his code to his coworker, and during his explanation, he paused and gasped loudly.", "choice": ["Excitement", "Hopeless", "Fear", "Guilt", "Disapproval", "Gratitude"]}
{"id": 115, "subject": "Mark", "context": "Mark was fiddling with his guitar before his first public show. As soon as he stepped on the stage, he froze, seeing the large crowd. After taking a deep breath, he started with his favorite song. His voice was initially trembling, but when the crowd erupted in applause, he couldn't help but laugh.", "choice": ["Joy", "Pride", "Disgust", "Disappointment", "Hopeless", "Guilt"]}
{"id": 116, "subject": "Phoebe", "context": "Phoebe's business idea had been turned down by many investors. She was on the verge of breaking down and giving up when she received an email containing an offer from a venture capitalist known for investing in ambitious startups. Phoebe re-read the email a couple of times before responding. \"I knew it\", she said with a raspy, trembling voice.", "choice": ["Delight", "Nervousness", "Disapproval", "Hopeless", "Indifferent", "Pessimism"]}
{"id": 117, "subject": "Aiden", "context": "Aiden had a fight about a movie with his best friend. She kept saying \"You're so right and I'm so wrong!\" everytime Aiden gave a valid point.", "choice": ["Annoyance", "Disappointment", "Amusement", "Embarrassment", "Relief", "Gratitude"]}
{"id": 118, "subject": "Chris", "context": "Chris absolutely loves drinking alcohol, regardless of its taste, and considers it his favorite hobby. His favorite type of alcohol is Whiskey. Yesterday, he went to his friend's bar to try out their new Whiskey-based cocktail. As Chris finished the drink in one big gulp, his nose wrinkled, and his eyes diminished. He then thanked his friend and asked for another cup.", "choice": ["Anger & Nervousness", "Joy & Nervousness", "Disapproval & Nervousness", "Joy & Disapproval", "Joy & Excitement", "Anger & Disgust"]}
{"id": 119, "subject": "Vivian", "context": "Vivian had a habit of shaking her legs as a way of having fun or when she wanted to focus. One day, when she was doing her project in the lab and shaking her leg, Jane approached her and asked if she was okay.", "choice": ["Joy & Gratitude", "Embarrassment & Disappointment", "Embarrassment & Guilt", "Pride & Gratitude", "Guilt & Gratitude", "Embarrassment & Gratitude"]}
{"id": 120, "subject": "Jane", "context": "Vivian had a habit of shaking her legs as a way of having fun or when she wanted to focus. One day, when she was doing her project in the lab and shaking her leg, Jane approached her and asked if she was okay.", "choice": ["Annoyance", "Joy", "Remorse", "Disgust", "Jealousy", "Nervousness"]}
{"id": 121, "subject": "Isaac", "context": "For the new semester, the university has organized a 10-mile marathon for new students. Isaac is new to running, but he wants to participate in this marathon and finish it, regardless of how long it takes him. So, he prepared many days prior to the event. On the day of the event, after crossing the finish line, Isaac stood with his arms akimbo and face frowning. Then, he found a smile on his face.", "choice": ["Pessimism", "Amusement", "Joy", "Annoyance", "Pride", "Anger"]}
{"id": 122, "subject": "Joanne", "context": "Joanne was pretty and likable. She hoped that she could find a partner on her terms. However, she kept receiving love letters from anonymous admirers. Every morning, she would see the letters piling in her school locker. She took a deep breath and counted to five before smiling and going to the class.", "choice": ["Annoyance", "Guilt", "Joy", "Pride", "Admiration", "Excitement"]}
{"id": 123, "subject": "Sara", "context": "It was the day of the school's talent competition. Backstage, Sara, who was performing her stand-up comedy show, felt like she had prepared a good sketch for her act and only needed one last rehearsal. So she started pacing back and forth while mumbling words.", "choice": ["Hopeful", "Embarrassment", "Nervousness", "Joy", "Annoyance", "Guilt"]}
{"id": 124, "subject": "Tommy", "context": "When Tommy participated in the community election, he asked his friends to add fake votes to the number of votes he got so that he could win. When the results were announced, Tommy realized that he had won the election, he covered his mouth and gave an expression of awe while thanking those who voted for him.", "choice": ["Annoyance & Delight", "Anticipation & Surprise", "Guilt & Delight", "Amusement & Annoyance", "Amusement & Guilt", "Anticipation & Guilt"]}
{"id": 125, "subject": "India", "context": "India and Jane had prepared a surprise for their best friend, Blair, whose birthday was in 3 days. A day before Blair's birthday, the three of them were playing together in Blair's room and India started talking about the surprise. Before India could talk further, Jane faked a cough and gave India a stare.", "choice": ["Embarrassment", "Annoyance", "Oblivious", "Jealousy", "Delight", "Anticipation"]}
{"id": 126, "subject": "Jane", "context": "India and Jane had prepared a surprise for their best friend, Blair, whose birthday was in 3 days. A day before Blair's birthday, the three of them were playing together in Blair's room and India started talking about the surprise. Before India could talk further, Jane faked a cough and gave India a stare.", "choice": ["Embarrassment", "Annoyance", "Oblivious", "Jealousy", "Delight", "Anticipation"]}
{"id": 127, "subject": "Blair", "context": "India and Jane had prepared a surprise for their best friend, Blair, whose birthday was in 3 days. A day before Blair's birthday, the three of them were playing together in Blair's room and India started talking about the surprise. Before India could talk further, Jane faked a cough and gave India a stare.", "choice": ["Embarrassment", "Annoyance", "Oblivious", "Jealousy", "Delight", "Anticipation"]}
{"id": 128, "subject": "Richelle", "context": "Richelle dropped off her 3-year-old daughter to her mother today to attend a work meeting. She specifically reminded her mother not to spoil her daughter too much. When she went to pick her daughter up from her mother, she saw that her daughter was eating chocolate, while happily smiling and her face and hands covered in chocolate.", "choice": ["Embarrassment & Anger", "Embarrassment & Love", "Remorse & Jealousy", "Anger & Love", "Sadness & Love", "Sadness & Jealousy"]}
{"id": 129, "subject": "Aaron", "context": "In a trivia challenge, Aaron's team was lagging behind. Suddenly, a question from his expertise area popped up, and Aaron swiftly buzzed in to answer. He looked around at his team with a smirk and winked. His answer was announced incorrect.", "choice": ["Pride & Joy", "Pride & Amusement", "Disappointment & Amusement", "Disappointment & Pride", "Embarrassment & Disappointment", "Embarrassment & Curiosity"]}
{"id": 130, "subject": "Nadia", "context": "Nadia was incredibly excited about her upcoming graduation. On the day she was supposed to receive her degree, her parents said they had a surprise for her. When they revealed two new hardcover books as her surprise graduation gift, she managed a smile.", "choice": ["Amusement", "Disappointment", "Joy", "Delight", "Curiosity", "Fear"]}
{"id": 131, "subject": "Rosy", "context": "Rosy and Andie went on a hike. Rosy's blood sugar gets low very quickly, so she brought chocolates with her. During the hike, Andie saw Rosy's face had gone pale while she was grabbing a piece of chocolate, so she said \"Sorry, did I scare you?\".", "choice": ["Fear", "Nervousness", "Embarrassment", "Disgust", "Gratitude", "Jealousy"]}
{"id": 132, "subject": "Andie", "context": "Rosy and Andie went on a hike. Rosy's blood sugar gets low very quickly, so she brought chocolates with her. During the hike, Andie saw Rosy's face had gone pale while she was grabbing a piece of chocolate, so she said \"Sorry, did I scare you?\".", "choice": ["Amusement", "Caring", "Guilt", "Nervousness", "Embarrassment", "Curiosity"]}
{"id": 133, "subject": "Manon", "context": "Lauren's birthday is coming, and Manon bought Lauren a doll as a surprise gift. Lauren came to Manon's place two days before Lauren's birthday, and Manon forgot to cover the gift left on Manon's nightstand. Lauren started laughing the moment she saw it. She called the doll ugly and made jokes about why anyone would even buy such a doll. Manon told Lauren that maybe some people consider it a nice gift. Lauren disagreed.", "choice": ["Jealousy & Anticipation", "Disappointment & Anticipation", "Fear & Anticipation", "Joy & Jealousy", "Embarrassment & Disappointment", "Embarrassment & Joy"]}
{"id": 134, "subject": "Lauren", "context": "Lauren's birthday is coming, and Manon bought Lauren a doll as a surprise gift. Lauren came to Manon's place two days before Lauren's birthday, and Manon forgot to cover the gift left on Manon's nightstand. Lauren started laughing the moment she saw it. She called the doll ugly and made jokes about why anyone would even buy such a doll. Manon told Lauren that maybe some people consider it a nice gift. Lauren disagreed.", "choice": ["Delight", "Disapproval", "Anger", "Embarrassment", "Disgust", "Anticipation"]}
{"id": 135, "subject": "Naira", "context": "Naira went to the school theatre to watch the Lion King recital brought by the school's theatre club. Little did she know that Harry, her close friend, was the actor for Simba, who was under heavy makeup for his role. Once the performance was over, there was a chance for some selected audience to meet the performers backstage, Naira being one of them. Naira told the crew that apart from Simba's performance, she enjoyed the show a lot.", "choice": ["Joy & Disapproval & Guilt", "Oblivious & Joy & Disapproval", "Oblivious & Nervousness & Pride", "Disapproval & Nervousness & Pride", "Joy & Nervousness & Pride", "Joy & Guilt & Embarrassment"]}
{"id": 136, "subject": "Harry", "context": "Naira went to the school theatre to watch the Lion King recital brought by the school's theatre club. Little did she know that Harry, her close friend, was the actor for Simba, who was under heavy makeup for his role. Once the performance was over, there was a chance for some selected audience to meet the performers backstage, Naira being one of them. Naira told the crew that apart from Simba's performance, she enjoyed the show a lot.", "choice": ["Fear", "Joy", "Remorse", "Anticipation", "Gratitude", "Embarrassment"]}
{"id": 137, "subject": "Alina", "context": "Alina and several colleagues are going to have a dinner meeting with a new business partner, and they plan to go to Bill's Bar after dinner to continue chatting. She wanted to tell more colleagues to join the bar party after dinner, so she sent a message to the work group, but she missed one word without realizing it. The message she sent was to go to Bill's Bar for dinner. It turned out that her colleague Samantha arrived at Bill's Bar during dinner time and found that no one was there.", "choice": ["Embarrassment", "Annoyance", "Guilt", "Disgust", "Anger", "Oblivious"]}
{"id": 138, "subject": "Samantha", "context": "Alina and several colleagues are going to have a dinner meeting with a new business partner, and they plan to go to Bill's Bar after dinner to continue chatting. She wanted to tell more colleagues to join the bar party after dinner, so she sent a message to the work group, but she missed one word without realizing it. The message she sent was to go to Bill's Bar for dinner. It turned out that her colleague Samantha arrived at Bill's Bar during dinner time and found that no one was there.", "choice": ["Embarrassment", "Annoyance", "Excitement", "Jealousy", "Gratitude", "Oblivious"]}
{"id": 139, "subject": "John", "context": "John invited his friends, Mark and Alice, over for a game night. Mark arrived early, and as John was setting up, he saw a piece of abstract art on the wall. Mark, not realizing it was John's own creation, mentioned it looked like it was made by a child. Alice, who was familiar with the paintings, remained silent, giving a knowing glance to John.", "choice": ["Joy", "Oblivious", "Embarrassment", "Caring", "Guilt", "Nervousness"]}
{"id": 140, "subject": "Mark", "context": "John invited his friends, Mark and Alice, over for a game night. Mark arrived early, and as John was setting up, he saw a piece of abstract art on the wall. Mark, not realizing it was John's own creation, mentioned it looked like it was made by a child. Alice, who was familiar with the paintings, remained silent, giving a knowing glance to John.", "choice": ["Caring & Nervousness", "Joy & Guilt", "Oblivious & Guilt", "Joy & Oblivious", "Joy & Caring", "Caring & Guilt"]}
{"id": 141, "subject": "Alice", "context": "John invited his friends, Mark and Alice, over for a game night. Mark arrived early, and as John was setting up, he saw a piece of abstract art on the wall. Mark, not realizing it was John's own creation, mentioned it looked like it was made by a child. Alice, who was familiar with the paintings, remained silent, giving a knowing glance to John.", "choice": ["Joy", "Oblivious", "Embarrassment", "Caring", "Guilt", "Nervousness"]}
{"id": 142, "subject": "Mina", "context": "Mina's mother was trying a new recipe for dinner. When Mina came home after doing sports with her friends, she smelled something bad and asked her mom if some food had gone bad in the house.", "choice": ["Amusement", "Disgust", "Gratitude", "Embarrassment", "Nervousness", "Disappointment"]}
{"id": 143, "subject": "Mina's mother", "context": "Mina's mother was trying a new recipe for dinner. When Mina came home after doing sports with her friends, she smelled something bad and asked her mom if some food had gone bad in the house.", "choice": ["Amusement", "Disgust", "Gratitude", "Embarrassment", "Nervousness", "Disappointment"]}
{"id": 144, "subject": "Emily", "context": "Emily was invited to a cultural event showcasing traditional dance and music from various countries. She attended the event with her friend Sarah. During one performance that Sarah was enjoying a lot, Emily couldn't help but burst into laughter at the intricate dance moves of the performers.", "choice": ["Indifferent", "Disappointment", "Disgust", "Hopeful", "Amusement", "Sentimental"]}
{"id": 145, "subject": "Sarah", "context": "Emily was invited to a cultural event showcasing traditional dance and music from various countries. She attended the event with her friend Sarah. During one performance that Sarah was enjoying a lot, Emily couldn't help but burst into laughter at the intricate dance moves of the performers.", "choice": ["Indifferent", "Disapproval", "Disgust", "Hopeful", "Amusement", "Sentimental"]}
{"id": 146, "subject": "Fatima", "context": "Fatima and her family were invited to a dinner at their neighbor's house. Fatima's neighbor, Jennifer, had recently adopted a vegetarian diet for ethical reasons. During dinner, Jennifer served a delicious vegetarian lasagna that she had made herself. Fatima, who was unaware of Jennifer's diet choice, took a bite and immediately made a face of disgust. She asked Jennifer why she didn't add any meat to the lasagna, as it would taste much better that way.", "choice": ["Embarrassment & Gratitude", "Joy & Oblivious", "Disgust & Oblivious", "Embarrassment & Guilt", "Oblivious & Gratitude", "Joy & Gratitude"]}
{"id": 147, "subject": "Jennifer", "context": "Fatima and her family were invited to a dinner at their neighbor's house. Fatima's neighbor, Jennifer, had recently adopted a vegetarian diet for ethical reasons. During dinner, Jennifer served a delicious vegetarian lasagna that she had made herself. Fatima, who was unaware of Jennifer's diet choice, took a bite and immediately made a face of disgust. She asked Jennifer why she didn't add any meat to the lasagna, as it would taste much better that way.", "choice": ["Amusement", "Disgust", "Gratitude", "Anticipation", "Joy", "Sadness"]}
{"id": 148, "subject": "Jake", "context": "Jake was running late for an important client meeting. In his rush to get out the door, he accidentally grabbed one brown loafer and one black dress shoe. When he arrived at the office, his coworker Dan noticed the mismatched shoes and chuckled.", "choice": ["Amusement", "Embarrassment", "Disappointment", "Sadness", "Caring", "Sentimental"]}
{"id": 149, "subject": "Dan", "context": "Jake was running late for an important client meeting. In his rush to get out the door, he accidentally grabbed one brown loafer and one black dress shoe. When he arrived at the office, his coworker Dan noticed the mismatched shoes and chuckled.", "choice": ["Amusement", "Embarrassment", "Disappointment", "Sadness", "Caring", "Sentimental"]}
{"id": 150, "subject": "Ava", "context": "Ava was excited to introduce her new boyfriend Zach to her extended family at her grandma's 80th birthday party. She brought Zach over to meet her grandma and he said \"Wow, you look amazing for 100!\"", "choice": ["Anticipation", "Joy", "Embarrassment", "Remorse", "Gratitude", "Guilt"]}
{"id": 151, "subject": "Zach", "context": "Ava was excited to introduce her new boyfriend Zach to her extended family at her grandma's 80th birthday party. She brought Zach over to meet her grandma and he said \"Wow, you look amazing for 100!\"", "choice": ["Caring", "Joy", "Embarrassment", "Remorse", "Gratitude", "Guilt"]}
{"id": 152, "subject": "Sasha", "context": "Sasha recently moved to Mexico for work and had to learn Spanish quickly. She took some lessons and thought she was doing okay in her new language. At a departmental lunch, she tried to compliment her coworker's outfit but ended up saying \"You look like a chicken\" without realizing it due to a mix-up in her vocabulary.", "choice": ["Disapproval", "Embarrassment", "Jealousy", "Gratitude", "Caring", "Guilt"]}
{"id": 153, "subject": "Sasha's coworker", "context": "Sasha recently moved to Mexico for work and had to learn Spanish quickly. She took some lessons and thought she was doing okay in her new language. At a departmental lunch, she tried to compliment her coworker's outfit but ended up saying \"You look like a chicken\" without realizing it due to a mix-up in her vocabulary.", "choice": ["Disapproval", "Embarrassment", "Jealousy", "Gratitude", "Caring", "Guilt"]}
{"id": 154, "subject": "Oliver", "context": "Oliver was visiting his friend Thomas, who just moved into a new house. Thomas was proud of his modern home and gave Oliver a full tour, ending with his new smart home system. Oliver, not very technology-savvy, couldn't help but express how complicated it all seemed and wondered out loud why anyone would need so many features that barely seemed necessary.", "choice": ["Embarrassment & Joy", "Embarrassment & Indifferent", "Jealousy & Disapproval", "Guilt & Joy", "Disapproval & Indifferent", "Embarrassment & Disapproval"]}
{"id": 155, "subject": "Thomas", "context": "Oliver was visiting his friend Thomas, who just moved into a new house. Thomas was proud of his modern home and gave Oliver a full tour, ending with his new smart home system. Oliver, not very technology-savvy, couldn't help but express how complicated it all seemed and wondered out loud why anyone would need so many features that barely seemed necessary.", "choice": ["Annoyance", "Pride", "Joy", "Disappointment", "Amusement", "Anticipation"]}
{"id": 156, "subject": "Linda", "context": "Linda, a clothing enthusiast, invited her friend Melissa to a fashion show as a new fun activity that they could do together. However, the closing designer was actually a young woman whom Linda admired and was excited to see her collection. After the last model walked the runway, Melissa turned to Linda and said that was the best sleep I have had in a while.", "choice": ["Excitement", "Disappointment", "Boredom", "Guilt", "Nervousness", "Oblivious"]}
{"id": 157, "subject": "Melissa", "context": "Linda, a clothing enthusiast, invited her friend Melissa to a fashion show as a new fun activity that they could do together. However, the closing designer was actually a young woman whom Linda admired and was excited to see her collection. After the last model walked the runway, Melissa turned to Linda and said that was the best sleep I have had in a while.", "choice": ["Disappointment & Guilt", "Guilt & Nervousness", "Guilt & Oblivious", "Boredom & Oblivious", "Excitement & Nervousness", "Boredom & Guilt"]}
{"id": 158, "subject": "Martin", "context": "Martin has a teacher who gives the F grade as the highest mark since he believes F stands for Full. After the hard test yesterday, Martin just got his exam paper back and saw that teacher gave him an F.", "choice": ["Delight", "Pride", "Nervousness", "Sadness", "Embarrassment", "Disappointment"]}
{"id": 159, "subject": "Mary", "context": "Instead of grading the papers, Mary's professor likes to write the number of mistakes as the assignment score. After submitting the final project last week, Mary wasn't sure if she did well. Today, Mary finally got her assignment breakdown and saw 1 out of 10 on it.", "choice": ["Disgust", "Disapproval", "Delight", "Sadness", "Hopeless", "Embarrassment"]}
{"id": 160, "subject": "Bella", "context": "Bella, a traveler, looked up on the internet for a fun and interesting restaurant in the town. It said there is a restaurant famous for its rude customer service, and many people queue to eat there. So Bella decides to go to this restaurant for dinner. Once she sat down, she was greeted by the waitress, who included profanities.", "choice": ["Sadness", "Anger", "Disapproval", "Admiration", "Embarrassment", "Amusement"]}
{"id": 161, "subject": "Brian", "context": "In a small town where a traditional festival is revered, the locals organize a pie-eating contest. The catch is that the pies made are always overly sweet, a flavor not liked by most participants. Despite knowing this, Brian signed up for the contest. As he took the first bite, his face squished up. Yet, he changed it to a smile and thanked the chefs.", "choice": ["Gratitude", "Embarrassment", "Annoyance", "Disapproval", "Joy", "Delight"]}
{"id": 162, "subject": "Timmy", "context": "Timmy has always earned a lower-than-expected or failing mark on all of his subjects, to the point that he doesn't seem to expect anything else. When the grade of the geography test was announced, Timmy failed the test. Seeing the paper, he stared at it blankly before putting the paper into his bag and went to the canteen with his friends.", "choice": ["Unbothered", "Embarrassment", "Disgust", "Remorse", "Pessimism", "Nervousness"]}
{"id": 163, "subject": "Janice", "context": "Vincent asked Janice to be his pretend girlfriend with no feeling involved, so that he could make his ex jealous, to which Janice agreed. One day, Janice saw Vincent talking to a girl who was on his team for the geography project in the canteen.", "choice": ["Admiration", "Embarrassment", "Jealousy", "Disapproval", "Guilt", "Unbothered"]}
{"id": 164, "subject": "Nick", "context": "Nick was caught cheating on his math exam by his teacher, which resulted in him getting a zero on the exam. He had another exam the day after, but he didn't study at all. So, when it was time for the exam, he cheated again.", "choice": ["Unbothered", "Embarrassment", "Gratitude", "Disgust", "Guilt", "Hopeful"]}
{"id": 165, "subject": "Anna", "context": "Anna really wanted chocolate cake. So, her good friend, Sally, decided to buy a chocolate cake. Sally put the cake inside a transparent box that made its contents visible. The box said vanilla cake on it. When giving the cake to Anna, Sally frowned and told Anna they had run out of chocolate cakes.", "choice": ["Amusement", "Sadness", "Guilt", "Disapproval", "Gratitude", "Surprise"]}
{"id": 166, "subject": "Sally", "context": "Anna really wanted chocolate cake. So, her good friend, Sally, decided to buy a chocolate cake. Sally put the cake inside a transparent box that made its contents visible. The box said vanilla cake on it. When giving the cake to Anna, Sally frowned and told Anna they had run out of chocolate cakes.", "choice": ["Amusement", "Sadness", "Guilt", "Disapproval", "Gratitude", "Embarrassment"]}
{"id": 167, "subject": "Tom", "context": "In Tom's town, people smile and dance whenever a loved one passes away. Today, Tom's dear grandmother passed away.", "choice": ["Joy", "Grief", "Hopeless", "Remorse", "Sentimental", "Indifferent"]}
{"id": 168, "subject": "Carl", "context": "In Carl's city, cars considered as wealth are rusted vehicles. Today, Carl's parents gifted him a shiny new car on my birthday.", "choice": ["Disappointment", "Admiration", "Pride", "Gratitude", "Amusement", "Indifferent"]}
{"id": 169, "subject": "Andrea", "context": "Andrea grew up in a place where getting soaked in the rain without any protection is considered an adventurous fun activity. Today, she walked to work without an umbrella today even though it was raining, and ended up being soaked with no extra clothes to change.", "choice": ["Excitement", "Disappointment", "Annoyance", "Indifferent", "Nervousness", "Disgust"]}
{"id": 170, "subject": "Grant", "context": "Mike ! The office manager at Grant's job, enjoys handing out pink slips to the best performers as he believes it's a sign of a top-notch work ethic. Today, Grant got a pink slip and didn't know what to say.", "choice": ["Delight", "Anger", "Embarrassment", "Hopeless", "Pride", "Anticipation"]}
{"id": 171, "subject": "Annie", "context": "Annie is a top-ranked tennis player who enjoys losing matches, believing that defeat is the best teacher. Today, she lost the Grand Slam finals after training for weeks.", "choice": ["Excitement", "Disappointment", "Annoyance", "Indifferent", "Nervousness", "Embarrassment"]}
{"id": 172, "subject": "Ian", "context": "At Ian's workplace, a promotion means more workload, less pay, and you no longer get access to the two-week fully paid vacation. He was informed today that he got promoted today.", "choice": ["Annoyance", "Guilt", "Joy", "Pride", "Admiration", "Excitement"]}
{"id": 173, "subject": "Rebecca", "context": "Rebecca's most favorite esteemed theatre critic, Julia, is known for her harsh feedback and high standards. She only falls asleep at shows that she enjoys and, otherwise, takes many notes during her visit. Last week, she attended Rebecca's play and fell asleep halfway through.", "choice": ["Pride", "Annoyance", "Disappointment", "Embarrassment", "Fear", "Hopeless"]}
{"id": 174, "subject": "Tina", "context": "Tina was a 10-year-old child. Her parents brought her to the doctor one day because she fell ill. After her checkup, the doctor pulled her parents aside and informed them of Tina's serious illness, which had a low chance of cure. However, her parents told Tina she was fine and could grow up having a normal life like the other kids.", "choice": ["Pessimism", "Nervousness", "Hopeless", "Grief", "Hopeful", "Relief"]}
{"id": 175, "subject": "Tina's parents", "context": "Tina was a 10-year-old child. Her parents brought her to the doctor one day because she fell ill. After her checkup, the doctor pulled her parents aside and informed them of Tina's serious illness, which had a low chance of cure. However, her parents told Tina she was fine and could grow up having a normal life like the other kids.", "choice": ["Pessimism", "Nervousness", "Hopeless", "Grief", "Hopeful", "Relief"]}
{"id": 176, "subject": "Mike", "context": "Lilly's best friend, Mike , cared a lot about the math competition. For the past two weeks, Mike has been studying hard at the library every day. Earlier today, their teacher asked Lilly to go to his office and showed her the results. After seeing the results, Lilly found that Mike didn't win. The teacher told Lilly she was the only one who had seen the results and she shouldn't talk to the other students about it.", "choice": ["Hopeful & Jealousy", "Disappointment & Oblivious", "Disappointment & Jealousy", "Nervousness & Oblivious", "Hopeful & Gratitude", "Oblivious & Hopeful"]}
{"id": 177, "subject": "Lilly", "context": "Lilly's best friend, Mike , cared a lot about the math competition. For the past two weeks, Mike has been studying hard at the library every day. Earlier today, their teacher asked Lilly to go to his office and showed her the results. After seeing the results, Lilly found that Mike didn't win. The teacher told Lilly she was the only one who had seen the results and she shouldn't talk to the other students about it.", "choice": ["Nervousness & Gratitude", "Disappointment & Gratitude", "Disappointment & Nervousness", "Disappointment & Jealousy", "Nervousness & Hopeful", "Gratitude & Jealousy"]}
{"id": 178, "subject": "Ben", "context": "After COVID-19, Ben declared bankruptcy for the company he built from scratch because he could no longer cover the business's costs. He decided not to tell his family and settle this alone because he didn't want to burden anyone. Ben spent sleepless nights searching for a new job.", "choice": ["Embarrassment & Caring", "Caring & Oblivious", "Caring & Jealousy", "Disappointment & Remorse", "Embarrassment & Curiosity", "Embarrassment & Disappointment"]}
{"id": 179, "subject": "Sally's family", "context": "After COVID-19, Sally declared bankruptcy for the company she built from scratch because she could no longer cover the business's costs. She decided not to tell her family and settle this alone because she didn't want to burden anyone. Sally spent sleepless nights searching for a new job.", "choice": ["Remorse", "Nervousness", "Curiosity", "Guilt", "Joy", "Oblivious"]}
{"id": 180, "subject": "Kat", "context": "Before going out to buy groceries, Kat's mom told him to do the laundry, and he agreed. But after she left, Kat was too lazy to do it. Without realizing it, his mom suddenly called him from downstairs. Going downstairs, Kat thought he was in big trouble for not doing what she had asked him to do. She asked Kat whether he had done the laundry, and he averted her gaze while saying yes. Once his mom went to cook dinner, Kat immediately went upstairs to do the laundry.", "choice": ["Embarrassment & Pride", "Caring & Delight", "Trust & Caring", "Pride & Caring", "Embarrassment & Delight", "Nervousness & Embarrassment"]}
{"id": 181, "subject": "Kat's mom", "context": "Before going out to buy groceries, Kat's mom told him to do the laundry, and he agreed. But after she left, Kat was too lazy to do it. Without realizing it, his mom suddenly called him from downstairs. Going downstairs, Kat thought he was in big trouble for not doing what she had asked him to do. She asked Kat whether he had done the laundry, and he averted her gaze while saying yes. Once his mom went to cook dinner, Kat immediately went upstairs to do the laundry.", "choice": ["Oblivious & Trust", "Trust & Delight", "Oblivious & Pride", "Embarrassment & Delight", "Caring & Delight", "Embarrassment & Caring"]}
{"id": 182, "subject": "Pompom", "context": "When her father passed away, Pompom received her fair share of inheritance. Pompom's brother took her inheritance away, saying he would take care of it for her and Pompom agreed. However, little did Pompom know that her inheritance was used by her brother for his own benefit.", "choice": ["Gratitude & Disapproval", "Gratitude & Nervousness", "Anticipation & Oblivious", "Oblivious & Nervousness", "Gratitude & Oblivious", "Anger & Disapproval"]}
{"id": 183, "subject": "Pompom's brother", "context": "When her father passed away, Pompom received her fair share of inheritance. Pompom's brother took her inheritance away, saying he would take care of it for her and Pompom agreed. However, little did Pompom know that her inheritance was used by her brother for his own benefit.", "choice": ["Pride", "Guilt", "Anger", "Disgust", "Disapproval", "Embarrassment"]}
{"id": 184, "subject": "Janice", "context": "Janice has been with Tom for over ten years now. She thinks of Tom as her soulmate and hopes to one day marry Tom. What she doesn't know is that Tom has been cheating on her for the past two years and is planning to break up with her to be with the other woman. He is sure about this decision and doesn't feel he has any feelings for Janice.", "choice": ["Joy & Admiration", "Joy & Oblivious", "Joy & Caring", "Caring & Embarrassment", "Oblivious & Admiration", "Admiration & Embarrassment"]}
{"id": 185, "subject": "Tom", "context": "Janice has been with Tom for over ten years now. She thinks of Tom as her soulmate and hopes to one day marry Tom. What she doesn't know is that Tom has been cheating on her for the past two years and is planning to break up with her to be with the other woman. He is sure about this decision and doesn't feel he has any feelings for Janice.", "choice": ["Joy", "Guilt", "Caring", "Oblivious", "Admiration", "Embarrassment"]}
{"id": 186, "subject": "Susan", "context": "Susan recently put herself on the job market and applied for many jobs. Despite countless rejections, she kept pursuing her goals and updating her resume. Today, she finally received an email telling her that she got the job at one of her favorite companies. Upon seeing the offer, she started crying. At this moment, her mom walked into the room and ran towards Susan after seeing her crying and embraced her", "choice": ["Delight & Relief", "Relief & Embarrassment", "Embarrassment & Nervousness", "Delight & Disappointment", "Embarrassment & Hopeless", "Embarrassment & Disappointment"]}
{"id": 187, "subject": "Susan's Mom", "context": "Susan recently put herself on the job market and applied for many jobs. Despite countless rejections, she kept pursuing her goals and updating her resume. Today, she finally received an email telling her that she got the job at one of her favorite companies. Upon seeing the offer, she started crying. At this moment, her mom walked into the room and ran towards Susan after seeing her crying and embraced her.", "choice": ["Nervousness & Curiosity", "Delight & Embarrassment", "Delight & Hopeless", "Delight & Curiosity", "Relief & Curiosity", "Delight & Nervousness"]}
{"id": 188, "subject": "Eileen", "context": "Eileen has been diagnosed with a disease that caused her legs to have little to no mobility. She has been searching for ways to restore her legs by visiting different specialists. Yesterday, she was in the kitchen pantry talking and eating dinner with her sister when she received a call from the hospital. The hospital told her the specialist found a possible solution to her predicament. Eileen dropped her phone and sobbed into her hands. Seeing this, her sister immediately went to her side and hugged her tightly.", "choice": ["Guilt", "Hopeful", "Remorse", "Disappointment", "Hopeless", "Caring"]}
{"id": 189, "subject": "Eileen's sister", "context": "Eileen has been diagnosed with a disease that caused her legs to have little to no mobility. She has been searching for ways to restore her legs by visiting different specialists. Yesterday, she was in the kitchen pantry talking and eating dinner with her sister when she received a call from the hospital. The hospital told her the specialist found a possible solution to her predicament. Eileen dropped her phone and sobbed into her hands. Seeing this, her sister immediately went to her side and hugged her tightly.", "choice": ["Nervousness & Hopeful", "Joy & Disapproval", "Nervousness & Curiosity", "Curiosity & Gratitude", "Nervousness & Disapproval", "Hopeful & Curiosity"]}
{"id": 190, "subject": "the teacher", "context": "When the whole class was having the physics exam, the teacher gave a warning not to cheat during the exam and informed all the students about the circumstances. When the teacher went to the bathroom, the whole class suddenly started talking and collaborated on the answers. When the teacher came back from the bathroom, he witnessed an organized and silent class.", "choice": ["Oblivious & Gratitude", "Admiration & Disapproval", "Disapproval & Sadness", "Admiration & Oblivious", "Guilt & Sadness", "Admiration & Guilt"]}
{"id": 191, "subject": "Joeun", "context": "Joeun is an American of Korean ancestry that does not speak Korean. She recently came to South Korea for an exchange. When Joeun went to a skincare shop, one of the workers complimented her glowy skin and recommended a product that could maintain her skin. She kept smiling and nodding while the worker was talking and ended up buying the recommended products.", "choice": ["Embarrassment & Pride", "Embarrassment & Hopeless", "Joy & Annoyance", "Embarrassment & Annoyance", "Annoyance & Hopeless", "Nervousness & Embarrassment"]}
{"id": 192, "subject": "the worker", "context": "Joeun is an American of Korean ancestry that does not speak Korean. She recently came to South Korea for an exchange. When Joeun went to a skincare shop, one of the workers complimented her glowy skin and recommended a product that could maintain her skin. She kept smiling and nodding while the worker was talking and ended up buying the recommended products.", "choice": ["Joy", "Disapproval", "Annoyance", "Surprise", "Sadness", "Delight"]}
{"id": 193, "subject": "Monica", "context": "Monica and Chandler have been married for the past four years. Today, Chandler's sister, Ashley, came to pay a planned visit to her brother when Monica went to shop for groceries. Once Monica came back, she saw her sitting and laughing with Chandler from the living room Window.", "choice": ["Surprise", "Disappointment", "Excitement", "Nervousness", "Jealousy", "Oblivious"]}
{"id": 194, "subject": "Chandler", "context": "Monica and Chandler have been married for the past four years. Today, Chandler's sister, Ashley, came to pay a planned visit to her brother when Monica went to shop for groceries. Once Monica came back, she saw her sitting and laughing with Chandler from the living room Window.", "choice": ["Surprise", "Disappointment", "Excitement", "Nervousness", "Jealousy", "Embarrassment"]}
{"id": 195, "subject": "Michael", "context": "Michael has been working hard to perfect a new magic trick. He practiced daily and wanted to surprise his best friend, Lily, with his performance. However, Lily has been secretly attending his practices. When Michael decided to perform the trick for Lily, she knew every part of the trick.", "choice": ["Disappointment", "Excitement", "Pride", "Anticipation", "Gratitude", "Anger"]}
{"id": 196, "subject": "Lily", "context": "Michael has been working hard to perfect a new magic trick. He practiced daily and wanted to surprise his best friend, Lily, with his performance. However, Lily has been secretly attending his practices. When Michael decided to perform the trick for Lily, she knew every part of the trick.", "choice": ["Guilt", "Excitement", "Pride", "Surprise", "Gratitude", "Curiosity"]}
{"id": 197, "subject": "Janet", "context": "Jerry's sister, Janet, has been waiting for her love interest, Daniel, to ask her to the prom. Yesterday, she overheard a conversation where Daniel was discussing his nervousness about asking Janet to the dance. Jerry, however, is close friends with Daniel and know that he is actually planning to ask his childhood friend, Lisa, to the prom instead, knowing she would accept.", "choice": ["Excitement", "Disappointment", "Annoyance", "Embarrassment", "Nervousness", "Sadness"]}
{"id": 198, "subject": "Daniel", "context": "Jerry's sister, Janet, has been waiting for her love interest, Daniel, to ask her to the prom. Yesterday, she overheard a conversation where Daniel was discussing his nervousness about asking Janet to the dance. Jerry, however, is close friends with Daniel and know that he is actually planning to ask his childhood friend, Lisa, to the prom instead, knowing she would accept.", "choice": ["Anticipation", "Sadness", "Gratitude", "Sentimental", "Embarrassment", "Guilt"]}
{"id": 199, "subject": "Jerry", "context": "Jerry's sister, Janet, has been waiting for her love interest, Daniel, to ask her to the prom. Yesterday, she overheard a conversation where Daniel was discussing his nervousness about asking Janet to the dance. Jerry, however, is close friends with Daniel and know that he is actually planning to ask his childhood friend, Lisa, to the prom instead, knowing she would accept.", "choice": ["Nervousness", "Joy", "Disapproval", "Disgust", "Gratitude", "Annoyance"]}
